import React, { useState } from 'react'
// Quotes
const quotes = [
  "أنت دائما أهل للنجاح والتفوق",
  "حياتك قصة وأنت تلعب دور البطل",
  "كل يوم هو بداية جديدة",
  "تحلى بالصبر واسع لتحقيق هدف سامي",
  "اعمل بجد، احلم أحلاما كبيرة، لا تستسلم أبدا",
  "سأبدأ، سأجرب، سأحاول، إن نجحت فأنا بطل وإن فشلت فأنا بشر",
  "النجاح خطوات مستمرة تتعثر حينا وتسير حينا حتى تصل إلى الهدف أو قريبا منه",
  "إذا سقطت فأكمل المسير، إذا فشلت فحاول وكرر، إذا خفت فقاوم وواجه",
  "لكل شخص يستمر بالكفاح مهما كسرت الأيام مجاديفه، لكل شخص إيجابي يقاوم لأجل مستقبله وأمنياته ومبتغاه، أنت عظيم",
  "أعد النظر في أفكارك تجاه الحياة واستعد ابتسامتك المشرقة فمهما كان ماضيك مليئا بالمشاكل فإن المستقبل مفعم بالأمل عامر بالفرص",
  "القوي لا يكذب، العظيم لا يكذب، الواثق لا يكذب، الشجاع لا يكذب، المتأكد لا يكذب",
  "قل الحقيقة فالكذب قد ينقذك من الموقف لكنه ينحر في ثقتك وتقديرك لذاتك",
  "أكبر سبب لهز الثقة أن تعصي الله سرا",
  "لا تجعل اعتمادك في تقدير ذاتك على رأي الناس فيك، اجعل كلام الناس يدفعك لا يمنعك، يحفزك لا يعجزك",
  "تقدير الذات: رأيك في ذاتك وشعورك بقيمتك دون الحاجة للنجاح أو الثناء من أحد",
  "الحلول العميقة والمؤثرة في رفع  مستوى الثقة: حسن الظن بالله، تقبل الذات، توكيد الذات، أداء الواجبات",
  "تقبل الذات أن تتقبل شكلك وترضى به ",
  "تقبل ذاتك بكل ما فيها ثم قم بتحسين ما يمكن تحسينه وتغيير ما يمكن تغييره",
  "تقبل نفسك، لأن قيمتك ليست في شكلك. لا ينظر الله إلى الصور والأشكال بل ينظر إلى القلوب والأعمال",
  "توكيد الذات هو أن تقول وتفعل ما تشعر به",
  "تعلم ما تستطيع، أتقن ما تحتاجه، استمتع بما تحب",
  "عليك أن تعد نفسك بأنك ستصبح يوما ما تريد، أن تقول لنفسك بأنك تستطيع، أن تفعل كل الأشياء التي تساعدك في الوصول إلى هدفك",
  "تصالح مع الماضي لتعيش صفاء المستقبل",
]


function Quotes() {
  // Quotes
  const [counter, setCounter] = useState(2)
  return (
    <div className="cursor-pointer font-regu font-semibold" onClick={(event) => setCounter(counter + 1)}>
      {quotes[counter % quotes.length]}
    </div> 
  ); 
}
export default Quotes;

